{
  "type": "story",
  "title": "Meu Primeiro Dia de Aula",
  "description": "Seu primeiro dia na Academia Tokugawa. Conheça a escola e seus colegas.",
  "conditional_next_chapter": {
    "club_id": {
      "3": "1_2",
      "default": "1_1_2"
    }
  },
  "dialogues": [
    {"npc": "Diretor", "text": "Bem-vindo à Academia Tokugawa, {player_name}! É uma honra receber alguém com seu potencial único.", "image": "welcome.png"},
    {"npc": "Diretor", "text": "Por mais de um século e meio, nossa instituição tem sido o berço dos maiores talentos em habilidades especiais. Aqui, você não apenas dominará seus poderes, mas descobrirá seu verdadeiro propósito."},
    {"npc": "Diretor", "text": "Nossos ex-alunos lideram os mais diversos setores da sociedade - desde governos e corporações até organizações que operam nas sombras, mantendo o equilíbrio do mundo."},
    {"npc": "Diretor", "text": "Lembre-se sempre: seu poder é um reflexo de quem você é. As escolhas que fizer aqui definirão não apenas seu futuro, mas potencialmente o destino de muitos."},
    {"npc": "Narrador", "text": "O olhar penetrante do Diretor sugere que ele sabe mais sobre você do que aparenta. Você sente que pode aprofundar essa conversa usando o comando /falar."},
    {"npc": "Narrador", "text": "As imagens e registros compartilhados ficarão disponíveis em seu arquivo pessoal. Acesse-os a qualquer momento com o comando /registros."},
    {"npc": "Narrador", "text": "O saguão principal fervilha com novos estudantes. Alguns demonstram abertamente seus poderes, criando pequenos espetáculos de luz, manipulando objetos ou lendo pensamentos. Outros observam discretamente, avaliando a competição."},
    {"npc": "Junie", "text": "Olá, {player_name}! Sou Junie, sua assistente e guia na Academia Tokugawa. Estou aqui para orientá-lo neste novo mundo de possibilidades.", "image": "junie_intro.png"},
    {"npc": "Junie", "text": "Esta academia opera sob um sistema único de hierarquia baseado em poder e habilidade. Não é apenas sobre força bruta, mas também sobre como você utiliza seu potencial."},
    {"npc": "Junie", "text": "No topo da pirâmide estão os Reis e Rainhas - estudantes excepcionais cujas habilidades transcendem o comum. Abaixo deles, os Jack e Ás formam a elite que mantém a ordem e protege as tradições da academia."},
    {"npc": "Junie", "text": "Nosso campus é um ecossistema complexo: o Prédio Principal abriga as salas de aula e laboratórios; os Campos de Treinamento são áreas especialmente reforçadas para o desenvolvimento seguro de poderes; os Dormitórios são divididos por níveis; e cada Clube representa uma filosofia distinta de poder."},
    {"npc": "Junie", "text": "Como deseja começar sua jornada na Academia Tokugawa? O caminho que escolher agora poderá influenciar todo seu futuro aqui.", "choices": [
      {"text": "Quero conhecer os clubes e suas filosofias.", "next_dialogue": 7, "metadata": {"affinity_changes": {"Junie": 3}, "knowledge": 1}},
      {"text": "Prefiro explorar o campus por conta própria.", "next_dialogue": 8, "metadata": {"affinity_changes": {"Junie": -1}, "independence": 2}},
      {"text": "Me conte mais sobre o sistema de hierarquia e poder.", "next_dialogue": 9, "metadata": {"affinity_changes": {"Junie": 2}, "ambition": 1}},
      {"text": "Gostaria de saber mais sobre a história da Academia e o 'Incidente Zero'.", "next_dialogue": 10, "metadata": {"affinity_changes": {"Junie": 2, "Diretor": 1}, "mystery": 2}}
    ]}
  ],
  "additional_dialogues": {
    "7": [
      {"npc": "Junie", "text": "Excelente escolha! Os clubes representam diferentes filosofias de poder e oferecem caminhos únicos para o desenvolvimento de suas habilidades."},
      {"npc": "Junie", "text": "O Clube das Chamas, liderado por Kai Flameheart, acredita no poder da paixão e intensidade. Eles canalizam emoções em força bruta e dominam técnicas de energia térmica e transformação."},
      {"npc": "Junie", "text": "Os Ilusionistas Mentais, sob a tutela de Luna Mindweaver, exploram os recantos da mente. Telepatia, manipulação de percepção e controle mental são suas especialidades."},
      {"npc": "Junie", "text": "O Conselho Político, comandado pelo carismático Alexander Strategos, domina a arte da influência. Seus membros aprendem a amplificar carisma, persuasão e a sutilmente dobrar vontades."},
      {"npc": "Junie", "text": "Os Elementalistas, guiados pela sábia Gaia Naturae, buscam harmonia com as forças naturais. Eles manipulam elementos e criam simbioses com o ambiente natural."},
      {"npc": "Junie", "text": "O Clube de Combate, sob a liderança do disciplinado Ryuji Battleborn, foca na perfeição física e tática. Eles amplificam reflexos, força e resistência além dos limites humanos."},
      {"npc": "Junie", "text": "Cada clube não é apenas um grupo de treinamento, mas uma família e uma filosofia de vida. Sua escolha definirá seu caminho na academia e possivelmente seu futuro.", "image": "clubs_overview.png"},
      {"npc": "Junie", "text": "Qual dessas filosofias ressoa com sua essência? Qual caminho deseja seguir?", "choices": [
        {"text": "Clube das Chamas - Quero transformar minha paixão em poder", "next_chapter": "1_2", "metadata": {"club_id": 1, "affinity_changes": {"Kai Flameheart": 5, "Junie": 1}, "passion": 2, "control": -1}},
        {"text": "Ilusionistas Mentais - A mente é o verdadeiro campo de batalha", "next_chapter": "1_2", "metadata": {"club_id": 2, "affinity_changes": {"Luna Mindweaver": 5, "Junie": 1}, "intellect": 2, "empathy": 1}},
        {"text": "Conselho Político - Prefiro influenciar do que confrontar", "next_chapter": "1_2", "metadata": {"club_id": 3, "skip_tour": true, "affinity_changes": {"Alexander Strategos": 5, "Junie": 1}, "charisma": 2, "manipulation": 1}},
        {"text": "Elementalistas - Busco harmonia com as forças naturais", "next_chapter": "1_2", "metadata": {"club_id": 4, "affinity_changes": {"Gaia Naturae": 5, "Junie": 1}, "harmony": 2, "patience": 1}},
        {"text": "Clube de Combate - Quero superar meus limites físicos", "next_chapter": "1_2", "metadata": {"club_id": 5, "affinity_changes": {"Ryuji Battleborn": 5, "Junie": 1}, "discipline": 2, "strength": 1}}
      ]}
    ],
    "10": [
      {"npc": "Junie", "text": "Interessante que você pergunte sobre nossa história... especialmente sobre o Incidente Zero.", "image": "academy_history.png"},
      {"npc": "Junie", "text": "A Academia Tokugawa nasceu da visão de Hideo Tokugawa, um mestre de poderes extraordinário que viveu durante o período Meiji. Em 1873, ele reuniu doze indivíduos excepcionais - conhecidos como os Doze Fundadores - cada um dominando um aspecto único das habilidades especiais."},
      {"npc": "Junie", "text": "Os primeiros anos foram marcados por experimentação e descoberta. A academia funcionava em segredo, protegida por ilusões e barreiras mentais, enquanto os Fundadores desenvolviam métodos para treinar e aprimorar habilidades que o mundo exterior consideraria impossíveis."},
      {"npc": "Junie", "text": "Durante a Segunda Guerra Mundial, a academia enfrentou uma crise existencial. Alguns membros queriam usar seus poderes no conflito, enquanto outros defendiam neutralidade. Após intensos debates, a academia foi temporariamente fechada."},
      {"npc": "Narrador", "text": "Você nota que Junie hesita ligeiramente antes de continuar, como se estivesse decidindo quanto revelar."},
      {"npc": "Junie", "text": "Em 1950, a academia reabriu sob a liderança de Takeshi Tokugawa, neto do fundador, com um novo código de conduta: 'Poder sem sabedoria é o caminho para a destruição'. A academia começou a ensinar ética e responsabilidade junto com o desenvolvimento de habilidades."},
      {"npc": "Junie", "text": "Por décadas, a academia prosperou em relativa paz, expandindo sua influência e refinando suas técnicas. Até 1998..."},
      {"npc": "Junie", "text": "O Incidente Zero...", "image": "incident_zero_classified.png"},
      {"npc": "Junie", "text": "Os registros oficiais dizem que foi uma 'anomalia dimensional durante um experimento controlado'. A realidade é mais complexa. Um grupo de estudantes e professores tentou acessar o que chamavam de 'Fonte Primordial' - a origem teórica de todos os poderes."},
      {"npc": "Junie", "text": "O experimento... falhou. Ou talvez tenha sido bem-sucedido demais. As testemunhas relatam distorções na realidade, manifestações espontâneas de poderes nunca antes vistos, e... algo que atravessou brevemente o véu entre dimensões."},
      {"npc": "Junie", "text": "Três estudantes desapareceram completamente. Sete outros emergiram transformados, com poderes amplificados além da compreensão. Foi após este evento que o atual sistema de hierarquia foi implementado - não apenas como estrutura social, mas como medida de segurança."},
      {"npc": "Junie", "text": "Alguns sussurram que o Incidente Zero não foi um acidente, mas parte de um plano maior. Outros acreditam que abriu uma porta que nunca deveria ter sido aberta. A maioria dos registros detalhados foram selados pelo Conselho dos Anciãos."},
      {"npc": "Narrador", "text": "Você percebe que alguns estudantes próximos pararam para ouvir, claramente interessados no assunto. Um deles parece particularmente atento, anotando discretamente em um caderno."},
      {"npc": "Junie", "text": "Hoje, a Academia Tokugawa é mais do que uma escola - é um nexo de poder, conhecimento e mistério. Nossos ex-alunos moldam o mundo de formas que o público jamais compreenderá completamente."},
      {"npc": "Junie", "text": "E agora você está aqui, {player_name}. Coincidência? Talvez. Ou talvez você tenha um papel a desempenhar em nossa história contínua.", "metadata": {"mystery_knowledge": 1}},
      {"npc": "Junie", "text": "Bem, acho que já falei demais sobre o passado. O que importa agora é seu futuro na academia. Como deseja prosseguir?", "choices": [
        {"text": "Vamos conhecer os clubes e suas filosofias.", "next_dialogue": 7, "metadata": {"curiosity": 1}},
        {"text": "Prefiro explorar o campus por conta própria.", "next_dialogue": 8, "metadata": {"independence": 1}},
        {"text": "Quero saber mais sobre o sistema de hierarquia.", "next_dialogue": 9, "metadata": {"ambition": 1}},
        {"text": "Esse Incidente Zero me intriga. Onde posso descobrir mais?", "next_dialogue": 11, "metadata": {"mystery_seeker": 2, "affinity_changes": {"Diretor": -1, "Junie": 1}}}
      ]}
    ],
    "8": [
      {"npc": "Junie", "text": "Um espírito independente! Isso é admirável, {player_name}. Os maiores descobrimentos frequentemente vêm daqueles que traçam seus próprios caminhos."},
      {"npc": "Junie", "text": "Permita-me oferecer algumas orientações para sua exploração. O campus é vasto e nem todas as áreas são... digamos, acolhedoras para novos estudantes.", "image": "campus_map.png"},
      {"npc": "Junie", "text": "O Prédio Principal é aberto a todos e contém a Biblioteca Central - um tesouro de conhecimentos tanto mundanos quanto arcanos. O subsolo, no entanto, requer autorização especial."},
      {"npc": "Junie", "text": "Os Campos de Treinamento são divididos por níveis de poder. Recomendo começar pelos campos básicos até compreender melhor suas próprias capacidades. Acidentes... acontecem."},
      {"npc": "Narrador", "text": "Você nota um brilho de preocupação genuína nos olhos de Junie quando ela menciona 'acidentes'."},
      {"npc": "Junie", "text": "Os Dormitórios são organizados por hierarquia. Como novo estudante, você terá acesso ao Dormitório Inicial, mas com o tempo e conquistas, poderá ascender a acomodações mais privilegiadas."},
      {"npc": "Junie", "text": "Quanto às sedes dos Clubes, cada uma reflete a filosofia de seus membros. Algumas são acolhedoras a visitantes, outras... nem tanto. Observe antes de entrar."},
      {"npc": "Junie", "text": "Há também áreas menos conhecidas - jardins secretos, salas de estudo ocultas, e dizem que existem passagens subterrâneas que datam da fundação da academia. Descobri-las é parte da experiência."},
      {"npc": "Junie", "text": "Uma última dica: preste atenção aos símbolos nas portas. Vermelho significa perigo ou acesso restrito. Azul indica áreas de estudo. Verde marca zonas de relaxamento. E dourado... bem, dourado é reservado para a elite."},
      {"npc": "Junie", "text": "Estarei disponível através do sistema de comunicação da academia se precisar de assistência. Basta chamar meu nome três vezes em qualquer terminal."},
      {"npc": "Junie", "text": "Antes de iniciar sua jornada, você precisa se registrar em um clube. Esta escolha definirá seu caminho inicial, embora não seja permanente. Qual filosofia mais ressoa com sua natureza?", "choices": [
        {"text": "Clube das Chamas - A intensidade do fogo reflete minha alma", "next_chapter": "1_2", "metadata": {"club_id": 1, "affinity_changes": {"Kai Flameheart": 5, "Diretor": -1}, "independence": 2, "passion": 1}},
        {"text": "Ilusionistas Mentais - Prefiro os caminhos sutis da mente", "next_chapter": "1_2", "metadata": {"club_id": 2, "affinity_changes": {"Luna Mindweaver": 5, "Diretor": 1}, "independence": 2, "intellect": 1}},
        {"text": "Conselho Político - O verdadeiro poder está na influência", "next_chapter": "1_2", "metadata": {"club_id": 3, "skip_tour": true, "affinity_changes": {"Alexander Strategos": 5, "Diretor": 3}, "independence": 2, "charisma": 1}},
        {"text": "Elementalistas - Busco compreender as forças da natureza", "next_chapter": "1_2", "metadata": {"club_id": 4, "affinity_changes": {"Gaia Naturae": 5, "Diretor": 0}, "independence": 2, "harmony": 1}},
        {"text": "Clube de Combate - Quero forjar minha força no desafio", "next_chapter": "1_2", "metadata": {"club_id": 5, "affinity_changes": {"Ryuji Battleborn": 5, "Diretor": 2}, "independence": 2, "discipline": 1}}
      ]}
    ],
    "9": [
      {"npc": "Junie", "text": "O sistema hierárquico da Academia Tokugawa é mais do que uma simples classificação social - é um reflexo da realidade fundamental dos poderes.", "image": "hierarchy_system.png"},
      {"npc": "Junie", "text": "No ápice da pirâmide estão os Reis e Rainhas - estudantes de nível 5, cujos poderes transcendem o ordinário. Eles não apenas possuem habilidades devastadoras, mas também uma compreensão profunda da natureza de seus dons."},
      {"npc": "Junie", "text": "Atualmente, apenas três estudantes alcançaram este nível: Seraphina Frost, a Rainha de Gelo; Dante Infernus, o Rei das Chamas; e Orion Nexus, o Rei do Vazio. Cada um deles controla um aspecto diferente da academia."},
      {"npc": "Narrador", "text": "Você percebe que vários estudantes ao redor demonstram uma mistura de admiração e temor ao ouvir esses nomes."},
      {"npc": "Junie", "text": "Logo abaixo estão os Jack e Ás - nível 4, a elite executiva da academia. Enquanto os Reis e Rainhas raramente interferem diretamente nos assuntos cotidianos, os Jack e Ás são seus representantes diretos, garantindo que suas visões sejam implementadas."},
      {"npc": "Junie", "text": "O nível 3, a Elite, é composto por estudantes com habilidades excepcionais que lideram os diversos clubes e organizações. Eles frequentemente competem entre si por reconhecimento e a chance de ascender ao nível 4."},
      {"npc": "Junie", "text": "No nível 2 encontramos os Adeptos - estudantes com poderes acima da média que formam o núcleo operacional da academia. Muitos professores e mentores vêm deste nível."},
      {"npc": "Junie", "text": "O nível 1 abrange os Iniciados - estudantes com poderes medianos que constituem a maioria da população estudantil. Não subestime este nível; muitos deles compensam limitações de poder com criatividade e determinação."},
      {"npc": "Junie", "text": "Por fim, no nível 0 estão os Observadores - estudantes com poderes latentes ou em desenvolvimento. Embora enfrentem desafios sociais, muitos dos maiores saltos na hierarquia vieram de estudantes que começaram neste nível."},
      {"npc": "Junie", "text": "É importante entender que a hierarquia não é estática. Avaliações periódicas, conhecidas como 'Provações', permitem que estudantes desafiem suas classificações atuais. Alguns ascendem rapidamente, outros permanecem estáveis por anos."},
      {"npc": "Junie", "text": "Além disso, cada nível traz privilégios e responsabilidades específicas. Acesso a áreas restritas, recursos especiais de treinamento, e até mesmo acomodações diferenciadas são determinados por sua posição."},
      {"npc": "Junie", "text": "Como novo estudante, você será inicialmente classificado após sua primeira semana de aulas e avaliações. Sua classificação inicial não define seu destino - é apenas o ponto de partida para sua jornada."},
      {"npc": "Junie", "text": "Há rumores de um nível além do 5, conhecido apenas como 'Transcendente', mas nenhum estudante na história moderna da academia alcançou tal status... pelo menos oficialmente.", "metadata": {"hierarchy_knowledge": 2}},
      {"npc": "Junie", "text": "Agora que você compreende melhor nosso sistema hierárquico, como deseja prosseguir em sua jornada na Academia Tokugawa?", "choices": [
        {"text": "Quero conhecer os clubes e suas filosofias.", "next_dialogue": 7, "metadata": {"ambition": 1}},
        {"text": "Prefiro explorar o campus por conta própria.", "next_dialogue": 8, "metadata": {"independence": 1}},
        {"text": "Gostaria de saber mais sobre a história da Academia.", "next_dialogue": 10, "metadata": {"curiosity": 1}},
        {"text": "Como posso me preparar para alcançar um nível alto?", "next_dialogue": 12, "metadata": {"ambition": 2, "affinity_changes": {"Junie": 1}}}
      ]}
    ],
    "11": [
      {"npc": "Junie", "text": "O Incidente Zero...", "image": "junie_concerned.png"},
      {"npc": "Junie", "text": "Devo alertá-lo, {player_name}, que investigar esse assunto não é... encorajado pela administração. Os registros oficiais são fortemente restritos."},
      {"npc": "Narrador", "text": "Junie olha ao redor nervosamente, como se verificando se alguém está ouvindo."},
      {"npc": "Junie", "text": "No entanto, se você está realmente determinado, existem algumas fontes que poderia consultar. A Biblioteca Central possui uma seção de Eventos Históricos no terceiro andar. Os arquivos públicos contêm apenas informações básicas, mas é um começo."},
      {"npc": "Junie", "text": "Há também um professor, Dr. Nakamura, que leciona História dos Poderes. Ele estava presente durante o incidente, embora raramente fale sobre isso. Suas aulas às vezes contêm pistas sutis para aqueles atentos o suficiente."},
      {"npc": "Junie", "text": "E existe um grupo estudantil não-oficial chamado 'Buscadores da Verdade'. Eles se reúnem nos jardins orientais após o pôr do sol às sextas-feiras. Oficialmente, é um clube de astronomia, mas seus verdadeiros interesses são... diferentes."},
      {"npc": "Narrador", "text": "Um estudante mais velho que passava parece ter ouvido parte da conversa. Ele lança um olhar penetrante em sua direção antes de seguir seu caminho."},
      {"npc": "Junie", "text": "Devo mencionar que alguns dos estudantes que investigaram muito profundamente o Incidente Zero enfrentaram... dificuldades acadêmicas inesperadas. Coincidência, talvez.", "metadata": {"mystery_knowledge": 2, "suspicion": 1}},
      {"npc": "Junie", "text": "Se decidir seguir esse caminho, sugiro discrição. E talvez seja melhor não mencionar esta conversa ao Diretor ou aos estudantes de nível superior.", "metadata": {"affinity_changes": {"Diretor": -2}}},
      {"npc": "Junie", "text": "Agora, talvez devêssemos mudar para um tópico menos... sensível. Como gostaria de prosseguir com sua orientação?", "choices": [
        {"text": "Vamos conhecer os clubes e suas filosofias.", "next_dialogue": 7, "metadata": {"mystery_seeker": 1}},
        {"text": "Prefiro explorar o campus por conta própria.", "next_dialogue": 8, "metadata": {"mystery_seeker": 1, "independence": 1}},
        {"text": "Quero saber mais sobre o sistema de hierarquia.", "next_dialogue": 9, "metadata": {"mystery_seeker": 1, "ambition": 1}},
        {"text": "Obrigado pela informação. Vou investigar discretamente.", "next_chapter": "1_1_2", "metadata": {"mystery_seeker": 3, "independence": 2, "affinity_changes": {"Junie": 2}}}
      ]}
    ],
    "12": [
      {"npc": "Junie", "text": "Ambição! Admiro isso em um novo estudante.", "image": "ambition_path.png"},
      {"npc": "Junie", "text": "Ascender na hierarquia da Academia Tokugawa requer uma combinação de talento natural, treinamento disciplinado e, não menos importante, inteligência estratégica."},
      {"npc": "Junie", "text": "Primeiro, você deve compreender completamente a natureza de seu próprio poder. Cada habilidade, não importa quão modesta pareça inicialmente, tem potencial para crescimento extraordinário quando propriamente cultivada."},
      {"npc": "Junie", "text": "Os estudantes que alcançam os níveis mais altos geralmente seguem um destes três caminhos: Especialização Profunda, Versatilidade Adaptativa, ou Inovação Revolucionária."},
      {"npc": "Junie", "text": "A Especialização Profunda envolve dominar completamente um único aspecto de seu poder, refinando-o até a perfeição. Dante Infernus, por exemplo, dedicou-se exclusivamente ao domínio do fogo, até poder controlar cada aspecto da combustão em nível molecular."},
      {"npc": "Junie", "text": "A Versatilidade Adaptativa significa desenvolver múltiplas aplicações para seu poder, tornando-se imprevisível e adaptável. Seraphina Frost pode não apenas criar gelo, mas manipular temperatura, umidade, e até mesmo percepções térmicas."},
      {"npc": "Junie", "text": "A Inovação Revolucionária é o caminho mais raro e arriscado - descobrir aplicações completamente novas para seu poder que desafiam as compreensões convencionais. Orion Nexus transformou uma simples habilidade de teleporte em manipulação completa do espaço-tempo."},
      {"npc": "Junie", "text": "Além do desenvolvimento de poder, você deve construir alianças estratégicas. Nenhum estudante alcança o topo sozinho. Escolha cuidadosamente seus aliados e mentores."},
      {"npc": "Junie", "text": "As Provações são sua oportunidade de demonstrar crescimento e avançar na hierarquia. Prepare-se não apenas treinando seu poder, mas estudando seus oponentes e o formato das avaliações."},
      {"npc": "Junie", "text": "Por fim, lembre-se que a paciência é crucial. Muitos estudantes talentosos arruinaram suas chances por tentar avançar rápido demais. A hierarquia não é apenas sobre poder bruto, mas sobre maturidade para utilizá-lo sabiamente."},
      {"npc": "Junie", "text": "Há um ditado entre os professores: 'O nível 1 é conquistado com talento, o nível 3 com trabalho árduo, e o nível 5 com transformação pessoal.'", "metadata": {"ambition": 1, "hierarchy_knowledge": 1}},
      {"npc": "Junie", "text": "Agora, com essas informações em mente, como deseja iniciar sua jornada na Academia Tokugawa?", "choices": [
        {"text": "Quero conhecer os clubes para encontrar mentores.", "next_dialogue": 7, "metadata": {"ambition": 1, "strategic": 1}},
        {"text": "Vou explorar o campus para descobrir recursos de treinamento.", "next_dialogue": 8, "metadata": {"ambition": 1, "independence": 1}},
        {"text": "Preciso aprender mais sobre a história da Academia.", "next_dialogue": 10, "metadata": {"ambition": 1, "knowledge": 1}},
        {"text": "Quero observar os estudantes de nível superior em ação.", "next_chapter": "1_1_2", "metadata": {"ambition": 2, "observation": 2, "affinity_changes": {"Junie": 1}}}
      ]}
    ]
  },
  "completion_exp": 50,
  "completion_tusd": 100,
  "next_chapter": "1_2"
}
