{
  "type": "story",
  "title": "Primeiros Passos na Academia",
  "description": "Continuação do seu primeiro dia na Academia Tokugawa após conhecer Junie.",
  "dialogues": [
    {"npc": "Junie", "text": "Agora que você conhece um pouco sobre a academia, vamos continuar nosso tour pelos clubes."},
    {"npc": "Junie", "text": "Cada clube tem sua própria filosofia e métodos de treinamento. Escolher o clube certo é importante para seu desenvolvimento."},
    {"npc": "Junie", "text": "Vamos começar pelo Clube das Chamas. Eles são conhecidos por seu treinamento intenso e foco em poderes destrutivos."}
  ],
  "skip_for_clubs": [3],
  "choices": [
    {"text": "Estou ansioso para conhecer os clubes!", "next_dialogue": 3},
    {"text": "Conte-me mais sobre o Clube das Chamas", "next_dialogue": 4},
    {"text": "Existem outros clubes além desse?", "next_dialogue": 5}
  ],
  "additional_dialogues": {
    "3": [
      {"npc": "Junie", "text": "Sua empolgação é admirável! A Academia Tokugawa tem orgulho de estudantes entusiasmados como você."},
      {"npc": "Junie", "text": "Vamos visitar todos os clubes principais hoje, e você poderá decidir qual se alinha melhor com seus objetivos e personalidade."},
      {"npc": "Junie", "text": "Lembre-se que sua escolha de clube afetará significativamente sua experiência na academia, então escolha com sabedoria!"}
    ],
    "4": [
      {"npc": "Junie", "text": "O Clube das Chamas é liderado por Kai Flameheart, um jovem de temperamento explosivo, mas com um coração leal."},
      {"npc": "Junie", "text": "Eles se especializam em poderes relacionados ao fogo e energia térmica, embora aceitem estudantes com outros tipos de habilidades também."},
      {"npc": "Junie", "text": "O treinamento deles é conhecido por ser rigoroso e intenso, focando em controle preciso e aplicações ofensivas dos poderes."}
    ],
    "5": [
      {"npc": "Junie", "text": "Sim, temos vários outros clubes importantes na academia!"},
      {"npc": "Junie", "text": "Os Ilusionistas Mentais focam em poderes psíquicos e manipulação da percepção. O Conselho Político se concentra em influência e estratégia."},
      {"npc": "Junie", "text": "Os Elementalistas estudam o equilíbrio e harmonia entre diferentes elementos, e o Clube de Combate se dedica a aprimorar técnicas de luta e aplicações práticas dos poderes."}
    ]
  },
  "shared_dialogue": [
    {"npc": "Junie", "text": "Ah, estamos chegando ao prédio do Clube das Chamas agora. Você pode sentir o calor emanando de dentro?"},
    {"npc": "Junie", "text": "Lembre-se de ser respeitoso ao conhecer Kai. Ele valoriza a honestidade e a determinação acima de tudo."}
  ],
  "choices_2": [
    {"text": "Estou pronto para conhecer Kai", "next_dialogue": 6},
    {"text": "Talvez devêssemos visitar outro clube primeiro?", "next_dialogue": 7},
    {"text": "Quais são as vantagens de se juntar ao Clube das Chamas?", "next_dialogue": 8}
  ],
  "additional_dialogues_2": {
    "6": [
      {"npc": "Junie", "text": "Excelente! Vamos entrar então."},
      {"npc": "Narrador", "text": "Ao entrar no prédio do Clube das Chamas, você é recebido por uma onda de calor e o som de treinamento intenso."},
      {"npc": "Narrador", "text": "Estudantes praticam controle de fogo em arenas especiais, enquanto outros meditam cercados por pequenas chamas flutuantes."}
    ],
    "7": [
      {"npc": "Junie", "text": "Claro, podemos ajustar nosso itinerário se preferir. Qual clube gostaria de visitar primeiro?"},
      {"npc": "Junie", "text": "Cada um tem suas próprias características únicas, e é importante que você se sinta confortável com sua escolha."},
      {"npc": "Junie", "text": "No entanto, o Clube das Chamas é tradicionalmente o primeiro a ser visitado pelos novos estudantes. Eles têm uma cerimônia de boas-vindas especial."}
    ],
    "8": [
      {"npc": "Junie", "text": "O Clube das Chamas oferece treinamento excepcional em controle de poder e aplicações ofensivas."},
      {"npc": "Junie", "text": "Eles têm as melhores instalações para treinamento físico e são conhecidos por produzir alguns dos lutadores mais formidáveis da academia."},
      {"npc": "Junie", "text": "Além disso, a camaradagem entre os membros é notável - eles realmente valorizam lealdade e trabalho em equipe, apesar de sua reputação de intensidade."}
    ]
  },
  "completion_exp": 50,
  "completion_tusd": 100,
  "next_chapter": "1_2"
}